backend/controllers/CustomerController.php

    public function actionIndex()
    {
        $searchModel = new CustomerSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $source_type_model = new \common\models\SourceType();
        $res = $source_type_model::find()->all();
        foreach ($res as $key => $value) {
            $new[$value->id] = $value->source_name;
        }
        $cs_res = CStore::find()->all();
        foreach ($cs_res as $key => $value) {
            $csres[$value->id] = $value->store_name;
        }
        $u_res = UserModel::find()->where(['department_id'=>12])->all();
---
SELECT * FROM `mly_source_type`
SELECT * FROM `mly_c_store`
SELECT * FROM `mly_user` WHERE `department_id`=12

    public function actionOpenlist($id){
        $model = new Customer();
        $billing_model = new BillingOperation();
        $data = $model::findOne($id);
        $hakim1 = UserModel::find()->where([
            'and'
            ,['=','store_id',Yii::$app->user->identity->store_id]
            ,['=','position_id',6]
        ])->all();
        $hakim2 = UserModel::find()->where([
            'and'
            ,['=','store_id',Yii::$app->user->identity->store_id]
            ,['=','position_id',38]
        ])->all();
        $hakim = array_merge($hakim1,$hakim2);
        $assistant = UserModel::find()->where(['and',['=','store_id',Yii::$app->user->identity->store_id],['=','position_id',7]])->all();
        $nurse1 = UserModel::find()->where(['and',['=','store_id',Yii::$app->user->identity->store_id],['=','position_id',28]])->all();
        $nurse2 = UserModel::find()->where(['and',['=','store_id',Yii::$app->user->identity->store_id],['=','position_id',8]])->all();
        $nurse = array_merge($nurse1,$nurse2);
        $role = [
            'hakim'=>$hakim,
            'assistant'=>$assistant,
            'nurse' => $nurse
        ];
        $surgical = SurgicalItems::find()->all();
---
SELECT * FROM `mly_customer` WHERE `id`='18'
SELECT * FROM `mly_user` WHERE (`store_id` = 8) AND (`position_id` = 6)
SELECT * FROM `mly_user` WHERE (`store_id` = 8) AND (`position_id` = 38)
SELECT * FROM `mly_user` WHERE (`store_id` = 8) AND (`position_id` = 7)
SELECT * FROM `mly_user` WHERE (`store_id` = 8) AND (`position_id` = 28)
SELECT * FROM `mly_user` WHERE (`store_id` = 8) AND (`position_id` = 8)
SELECT * FROM `mly_surgical_items`