backend/controllers/DrugOrderController.php

SELECT * FROM `mly_leechdom` WHERE (`status`=1) AND (`stock` > 0)
SELECT * FROM `mly_category` WHERE (`parent_id`=1) AND (`status`=1)
SELECT * FROM `mly_billing_operation` WHERE `id`='1'
---
    public function actionCreate($id)
    {
        $model = new DrugOrder();

        $modelsAddress = [new DrugOrderDetail()];

        // $model->bill_id = $_GET['id'];
        // $model->client_id = $billing['client_id'];
        // $model->order_number = 'MLYDD'.$this->random(4).Yii::$app->user->identity->id.time();
        // $model->amount = $amount;
        // $model->store_id = Yii::$app->user->identity->store_id;
        // $model->hakim_id = Yii::$app->user->identity->id;
        // $model->status = 100;
        // $model->created_time = time();

        $list = Leechdom::find()->where(['and',['status'=>1],['>','stock',0]])->all();

        $cate = \common\models\Category::find()->where(['and',['parent_id'=>1],['status'=>1]])->all();

        $billing = BillingOperation::findOne($id);