backend/controllers/SiteController.php

UPDATE `mly_user` SET `login_time`=1496307341, `login_ip`='127.0.0.1' WHERE `id`=47
---
    public function actionLogin()
    {

        $url = Yii::$app->request->getHostInfo(); // 获取当前url的域名
        // echo Yii::$app->request->getPathInfo(); // 获取当前除url域名外的后段
        $uarray = explode('//', $url);
        $server = $uarray[1];
        $server = explode('.',$server);
        $servername = $server[0];
        // var_dump($servername);

        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post()) && $model->login()) {

            User::updateAll(['login_time'=>time(),'login_ip'=>Yii::$app->request->userIP],['id'=>Yii::$app->user->identity->id]);