common/data/data.php

	public static function getRegion($areaCode)
	{
		if(is_array($areaCode)){
			$areaCode = implode(',',$areaCode);
			$region = Region::find()->asArray()->select('name')->where("id in($areaCode)")->all();
---
SELECT `name` FROM `mly_region` WHERE id in(220000,220100)