backend/views/customer/index.php

            [
                'attribute'=>'source',
                'value'=>function($model){
                    return \common\models\SourceType::find()->select('source_name')->where(['id'=>$model->source])->one()['source_name'];
---
SELECT `source_name` FROM `mly_source_type` WHERE `id`=2

                'detail' => function ($url, $model, $key) {
                    $customer_id = $model -> id;
                    $customer_detail_model = new CustomerDetail();
                    if(!$customer_detail_model::find()->where(['customer_id' => $customer_id])->one()){
---
SELECT * FROM `mly_customer_detail` WHERE `customer_id`=18

                'detailview' => function ($url, $model, $key) {
                    $customer_id = $model -> id;
                    $customer_detail_model = new CustomerDetail();
                    if($customer_detail_model::find()->select('id')->where(['customer_id' => $customer_id])->one()){
                        $customer_detail_id = $customer_detail_model::find()->select('id')->where(['customer_id' => $customer_id])->one()->id;
---
SELECT `id` FROM `mly_customer_detail` WHERE `customer_id`=18

                'detailupdate' => function ($url, $model, $key) {
                    $customer_id = $model -> id;
                    $customer_detail_model = new CustomerDetail();
                    if($customer_detail_model::find()->select('id')->where(['customer_id' => $customer_id])->one()){
                        $customer_detail_id = $customer_detail_model::find()->select('id')->where(['customer_id' => $customer_id])->one()->id;
---
SELECT `id` FROM `mly_customer_detail` WHERE `customer_id`=18